IOsonata/IOsonata/ARM/Nordic/nRF54/src/usb_ctrlr_nrf54.cpp
/**-------------------------------------------------------------------------
@file	usb_ctrlr_nrf54.cpp

@brief	USB device controller for Nordic nRF54 USBHS parts.

Direct register implementation for the high-speed USBHS peripheral. The port
owns VREGUSB, HFCLK24M, the USBHS core and its endpoint DMA/FIFO configuration.

DevNo selects the controller. Every nRF part has exactly one, USB_CTRLR_CNT is
1, so the entry points validate DevNo and the state stays a singleton. Arraying
it is work for the first part that carries two.

@author	Hoang Nguyen Hoan
@date	Sep. 3, 2026

@license

MIT License

Copyright (c) 2026, I-SYST inc., all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#include <stdint.h>
#include <string.h>

#include "nrf.h"
#include "nrf_peripherals.h"
#include "hal/nrf_ficr.h"
// Bus power, clock and VBUS.
// The USBHS clock and VBUS regulator are separate peripherals on this part.
#include "hal/nrf_clock.h"
#include "hal/nrf_vregusb.h"
#include "soc/nrfx_coredep.h"

#include "istddef.h"
#include "app_evt_handler.h"
#include "coredev/interrupt.h"
#include "usb/usb.h"


#ifndef NRFX_USBD_XTAL_WAIT_LOOPS
#define NRFX_USBD_XTAL_WAIT_LOOPS			2000000UL
#endif

#ifndef NRFX_USBD_READY_WAIT_LOOPS
#define NRFX_USBD_READY_WAIT_LOOPS			2000000UL
#endif


// Undocumented VREGUSB status register. The events below report the edges and
// are in the MDK, but the level is not, and something has to answer what the
// state is at start up before any edge has happened. Offset and bit are as
// used by Zephyr's regulator_nrf_vregusb driver, which says in its own source
// that the register is not part of NRF_VREGUSB_Type.
#define NRFX_USBD_VREGUSB_STATUS_OFS		0x400UL
#define NRFX_USBD_VREGUSB_STATUS_VBUSDET	(1UL << 2)


#ifndef USBHSCORE_PRESENT
#error "usbd_ctrlr_nrf54: this part has no USBHS core"
#endif

#define NRF54_USBD_EP_COUNT				16U
#define NRF54_USBD_EP0_MPS				64U
#define NRF54_USBD_SETUP_COUNT			3U
#define NRF54_USBD_SETUP_SIZE			8U
#define NRF54_USBD_WAIT_LOOPS			1000000UL

#if defined(NRF_TRUSTZONE_NONSECURE)
#define NRF54_USBD_CORE					NRF_USBHSCORE_NS
#else
#define NRF54_USBD_CORE					NRF_USBHSCORE_S
#endif

#define NRF54_USBD_REG(ofs) \
	(*(volatile uint32_t *)((uintptr_t)NRF54_USBD_CORE + (ofs)))

#define NRF54_USBD_GAHBCFG				NRF54_USBD_REG(0x008U)
#define NRF54_USBD_GUSBCFG				NRF54_USBD_REG(0x00CU)
#define NRF54_USBD_GRSTCTL				NRF54_USBD_REG(0x010U)
#define NRF54_USBD_GINTSTS				NRF54_USBD_REG(0x014U)
#define NRF54_USBD_GINTMSK				NRF54_USBD_REG(0x018U)
#define NRF54_USBD_GRXFSIZ				NRF54_USBD_REG(0x024U)
#define NRF54_USBD_GNPTXFSIZ			NRF54_USBD_REG(0x028U)
#define NRF54_USBD_GHWCFG2				NRF54_USBD_REG(0x048U)
#define NRF54_USBD_GHWCFG3				NRF54_USBD_REG(0x04CU)
#define NRF54_USBD_GDFIFOCFG			NRF54_USBD_REG(0x05CU)

#define NRF54_USBD_DCFG					NRF54_USBD_REG(0x800U)
#define NRF54_USBD_DCTL					NRF54_USBD_REG(0x804U)
#define NRF54_USBD_DSTS					NRF54_USBD_REG(0x808U)
#define NRF54_USBD_DIEPMSK				NRF54_USBD_REG(0x810U)
#define NRF54_USBD_DOEPMSK				NRF54_USBD_REG(0x814U)
#define NRF54_USBD_DAINT				NRF54_USBD_REG(0x818U)
#define NRF54_USBD_DAINTMSK				NRF54_USBD_REG(0x81CU)

#define NRF54_USBD_DIEPCTL(ep)			NRF54_USBD_REG(0x900U + ((ep) * 0x20U))
#define NRF54_USBD_DIEPINT(ep)			NRF54_USBD_REG(0x908U + ((ep) * 0x20U))
#define NRF54_USBD_DIEPTSIZ(ep)			NRF54_USBD_REG(0x910U + ((ep) * 0x20U))
#define NRF54_USBD_DIEPDMA(ep)			NRF54_USBD_REG(0x914U + ((ep) * 0x20U))

#define NRF54_USBD_DOEPCTL(ep)			NRF54_USBD_REG(0xB00U + ((ep) * 0x20U))
#define NRF54_USBD_DOEPINT(ep)			NRF54_USBD_REG(0xB08U + ((ep) * 0x20U))
#define NRF54_USBD_DOEPTSIZ(ep)			NRF54_USBD_REG(0xB10U + ((ep) * 0x20U))
#define NRF54_USBD_DOEPDMA(ep)			NRF54_USBD_REG(0xB14U + ((ep) * 0x20U))

#define NRF54_USBD_DIEPTXF(ep)			NRF54_USBD_REG(0x104U + (((ep) - 1U) * 4U))

#define NRF54_USBD_GAHBCFG_GINT			(1UL << 0)
#define NRF54_USBD_GAHBCFG_HBSTLEN_INCR4	(1UL << 1)
#define NRF54_USBD_GAHBCFG_DMAEN			(1UL << 5)

#define NRF54_USBD_GUSBCFG_FORCEDEVMODE	(1UL << 30)
#define NRF54_USBD_GUSBCFG_FORCEHSTMODE	(1UL << 29)

#define NRF54_USBD_GRSTCTL_CSFTRST		(1UL << 0)
#define NRF54_USBD_GRSTCTL_RXFFLSH		(1UL << 4)
#define NRF54_USBD_GRSTCTL_TXFFLSH		(1UL << 5)
#define NRF54_USBD_GRSTCTL_TXFNUM_Pos		6U
#define NRF54_USBD_GRSTCTL_AHBIDLE		(1UL << 31)
#define NRF54_USBD_GRSTCTL_TXFIFO_ALL		0x10UL

#define NRF54_USBD_GINTSTS_SOF			(1UL << 3)
#define NRF54_USBD_GINTSTS_GOUTNAKEFF		(1UL << 7)
#define NRF54_USBD_GINTSTS_USBSUSP		(1UL << 11)
#define NRF54_USBD_GINTSTS_USBRST		(1UL << 12)
#define NRF54_USBD_GINTSTS_ENUMDONE		(1UL << 13)
#define NRF54_USBD_GINTSTS_IEPINT		(1UL << 18)
#define NRF54_USBD_GINTSTS_OEPINT		(1UL << 19)
#define NRF54_USBD_GINTSTS_WKUPINT		(1UL << 31)

#define NRF54_USBD_GHWCFG2_ARCH_Pos		3U
#define NRF54_USBD_GHWCFG2_ARCH_Msk		(3UL << NRF54_USBD_GHWCFG2_ARCH_Pos)
#define NRF54_USBD_GHWCFG2_ARCH_INTDMA	(2UL << NRF54_USBD_GHWCFG2_ARCH_Pos)
#define NRF54_USBD_GHWCFG3_DFIFO_Pos		16U

#define NRF54_USBD_DCFG_DEVSPD_Msk		3UL
#define NRF54_USBD_DCFG_DEVSPD_HS		0UL
#define NRF54_USBD_DCFG_DEVADDR_Pos		4U
#define NRF54_USBD_DCFG_DEVADDR_Msk		(0x7FUL << NRF54_USBD_DCFG_DEVADDR_Pos)

#define NRF54_USBD_DCTL_RMTWKUPSIG		(1UL << 0)
#define NRF54_USBD_DCTL_SFTDISCON		(1UL << 1)
#define NRF54_USBD_DCTL_SGOUTNAK			(1UL << 9)
#define NRF54_USBD_DCTL_CGOUTNAK			(1UL << 10)

#define NRF54_USBD_DSTS_ENUMSPD_Pos		1U
#define NRF54_USBD_DSTS_ENUMSPD_Msk		(3UL << NRF54_USBD_DSTS_ENUMSPD_Pos)
#define NRF54_USBD_DSTS_ENUMSPD_HS		(0UL << NRF54_USBD_DSTS_ENUMSPD_Pos)
#define NRF54_USBD_DSTS_FNSOF_Pos		8U
#define NRF54_USBD_DSTS_FNSOF_Msk		(0x3FFFUL << NRF54_USBD_DSTS_FNSOF_Pos)

#define NRF54_USBD_DAINT_IN(ep)			(1UL << (ep))
#define NRF54_USBD_DAINT_OUT(ep)			(1UL << (16U + (ep)))

#define NRF54_USBD_DEPCTL_MPS_Msk		0x7FFUL
#define NRF54_USBD_DEPCTL_USBACTEP		(1UL << 15)
#define NRF54_USBD_DEPCTL_EPTYPE_Pos		18U
#define NRF54_USBD_DEPCTL_EPTYPE_Msk		(3UL << NRF54_USBD_DEPCTL_EPTYPE_Pos)
#define NRF54_USBD_DEPCTL_STALL			(1UL << 21)
#define NRF54_USBD_DIEPCTL_TXFNUM_Pos		22U
#define NRF54_USBD_DIEPCTL_TXFNUM_Msk		(0xFUL << NRF54_USBD_DIEPCTL_TXFNUM_Pos)
#define NRF54_USBD_DEPCTL_CNAK			(1UL << 26)
#define NRF54_USBD_DEPCTL_SNAK			(1UL << 27)
#define NRF54_USBD_DEPCTL_SETD0PID		(1UL << 28)
#define NRF54_USBD_DEPCTL_EPDIS			(1UL << 30)
#define NRF54_USBD_DEPCTL_EPENA			(1UL << 31)

#define NRF54_USBD_EP0_MPS_Msk			3UL
#define NRF54_USBD_EP0_MPS_64			0UL

