IOsonata/IOsonata/ARM/Nordic/nRF54/src/usb_ctrlr_nrf54.cpp
#define NRF54_USBD_DIEPINT_XFRC			(1UL << 0)
#define NRF54_USBD_DIEPINT_EPDISBLD		(1UL << 1)
#define NRF54_USBD_DIEPINT_INEPNAKEFF		(1UL << 6)
#define NRF54_USBD_DOEPINT_XFRC			(1UL << 0)
#define NRF54_USBD_DOEPINT_EPDISBLD		(1UL << 1)
#define NRF54_USBD_DOEPINT_SETUP			(1UL << 3)

#define NRF54_USBD_DIEPTSIZ0_XFERSIZE_Msk	0x7FUL
#define NRF54_USBD_DIEPTSIZ0_PKTCNT_Pos	19U
#define NRF54_USBD_DOEPTSIZ0_XFERSIZE_Msk	0x7FUL
#define NRF54_USBD_DOEPTSIZ0_PKTCNT_Pos	19U
#define NRF54_USBD_DOEPTSIZ0_SUPCNT_Pos	29U

#define NRF54_USBD_DEPTSIZ_XFERSIZE_Msk	0x7FFFFUL
#define NRF54_USBD_DEPTSIZ_PKTCNT_Pos		19U

#define NRF54_USBD_DOEPMSK_XFRC			(1UL << 0)
#define NRF54_USBD_DOEPMSK_SETUP			(1UL << 3)
#define NRF54_USBD_DIEPMSK_XFRC			(1UL << 0)

enum
{
	NRF_USB_EP_COUNT = USB_EPIN_CNT(0) > USB_EPOUT_CNT(0) ?
		USB_EPIN_CNT(0) : USB_EPOUT_CNT(0),
};

typedef struct __nRF_Usb_Ep_Registration
{
	uint8_t *pBuffer;
	UsbCtrlrEpHandler_t Handler;
	void *pContext;
	uint16_t Mps;
	bool bBlocking;
} nRFUsbEpReg_t;

typedef struct __nRF54_Usbd_Xfer
{
	uint8_t *pBuffer;
	uint16_t TotalLen;
	uint16_t ActualLen;
	uint16_t Mps;
	uint16_t ChunkLen;
	bool Started;
} nRF54UsbdXfer_t;

typedef struct __nRF54_Usbd_Ctrlr
{
	nRF54UsbdXfer_t Xfer[NRF54_USBD_EP_COUNT][2];
	uint16_t TxFifoWords[NRF54_USBD_EP_COUNT];
	uint16_t FifoTop;
	uint16_t RxWords;
	bool Started;
	bool HighSpeed;
	bool SofEnabled;
	bool AddressPending;
	uint8_t PendingAddress;
} nRF54UsbdCtrlr_t;

// Fixed data-endpoint ownership lives outside the active-transfer state so a
// bus reset can cancel transfers without losing registrations.
static nRFUsbEpReg_t s_EpReg[NRF_USB_EP_COUNT][2];

// One USB controller per part, so the common power/clock state is file scope.
// Controller interrupts are owned by the corresponding UsbdCtrlr backend.
static uint8_t s_UsbdIntPrio;
static bool s_UsbdLowPowerSuspend;
static bool s_UsbdInitialized = false;
static bool s_UsbdStarted = false;
static bool s_UsbdXtalHeld = false;
static bool s_UsbdVbusLast = false;


// The nRF54 reports VBUS edges, so retain the resulting level here.
static bool s_UsbdVbusLevel = false;

static nRF54UsbdCtrlr_t s_Ctrlr;

static uint32_t s_SetupBuffer[(NRF54_USBD_SETUP_COUNT * NRF54_USBD_SETUP_SIZE) /
								 sizeof(uint32_t)] __attribute__((aligned(4)));
static uint32_t s_Ep0Bounce[NRF54_USBD_EP0_MPS / sizeof(uint32_t)]
	__attribute__((aligned(4)));


static bool nRFUsbRegEpXfer(uint8_t EpAddr, uint8_t *pBuffer, uint16_t TotalBytes);

/// Only DevNo 0 exists on every nRF part shipped so far.
static inline __attribute__((always_inline))
bool nRFUsbValidDevNo(int DevNo)
{
	return DevNo == 0;
}

static inline __attribute__((always_inline))
uint8_t nRFUsbEpDir(uint8_t EpAddr)
{
	return USB_ENDPADDR_IS_IN(EpAddr) ? 1U : 0U;
}

static inline __attribute__((always_inline))
nRFUsbEpReg_t *nRFUsbGetEpReg(uint8_t EpAddr)
{
	return &s_EpReg[USB_ENDPADDR_NUM(EpAddr)][nRFUsbEpDir(EpAddr)];
}

static inline __attribute__((always_inline))
void nRFUsbEpRegisteredEvent(uint8_t EpAddr, UsbCtrlrEvtType_t Event,
								 uint16_t Length)
{
	nRFUsbEpReg_t *pReg = nRFUsbGetEpReg(EpAddr);
	pReg->Handler(Event, Length, pReg->pContext);
}

__attribute__((weak)) bool UsbdXtalRequest(void)
{
	// The USBHS PHY runs from the 24 MHz clock, not from the radio crystal.
	// This is a separate domain with its own task and its own started event.
	if (nrf_clock_is_running(NRF_CLOCK, NRF_CLOCK_DOMAIN_HFCLK24M, NULL))
	{
		return true;
	}

	nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_HFCLK24MSTARTED);
	nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_HFCLK24MSTART);

	for (uint32_t i = 0; i < NRFX_USBD_XTAL_WAIT_LOOPS; i++)
	{
		if (nrf_clock_event_check(NRF_CLOCK, NRF_CLOCK_EVENT_HFCLK24MSTARTED))
		{
			nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_HFCLK24MSTARTED);
			return true;
		}
	}

	return false;
}

__attribute__((weak)) void UsbdXtalRelease(void)
{
	// Left running. Other peripherals take this clock without
	// counting, so stopping one here would stop it under them.
}


/**
 * Consume the VBUS edges the regulator has recorded and answer the level they
 * leave behind. Polled rather than taken as an interrupt for the same reason
 * as the nRF52 side, and the events hold until they are cleared, so nothing
 * is lost between passes.
 */
static bool UsbdVbusPoll(void)
{
	if (nrf_vregusb_event_check(NRF_VREGUSB, NRF_VREGUSB_EVENT_VBUS_DETECTED))
	{
		nrf_vregusb_event_clear(NRF_VREGUSB, NRF_VREGUSB_EVENT_VBUS_DETECTED);
		s_UsbdVbusLevel = true;
	}

	if (nrf_vregusb_event_check(NRF_VREGUSB, NRF_VREGUSB_EVENT_VBUS_REMOVED))
	{
		nrf_vregusb_event_clear(NRF_VREGUSB, NRF_VREGUSB_EVENT_VBUS_REMOVED);
		s_UsbdVbusLevel = false;
	}

	return s_UsbdVbusLevel;
}

/**
 * Power the USBHS wrapper, its PHY and the core, in the order the part
 * requires. The two delays are not optional: a core register read before the
 * PHY clock is up can hang the bus. This sequence completes before
 * nRFUsbRegStart() touches NRF_USBHSCORE.
 *
 * The sequence follows Nordic's USBHS integration requirements, matching the
 * ordering used by Zephyr's Nordic USBHS vendor quirk implementation.
 */
static bool UsbdStartCtrlr(void)
{
	// Core first, PHY still held in reset
	NRF_USBHS->ENABLE = USBHS_ENABLE_CORE_Msk;

	// Device role, and hold VBUSVALID asserted while the core comes up
	NRF_USBHS->PHY.OVERRIDEVALUES =
		USBHS_PHY_OVERRIDEVALUES_ID_Device << USBHS_PHY_OVERRIDEVALUES_ID_Pos;
	NRF_USBHS->PHY.INPUTOVERRIDE =
		USBHS_PHY_INPUTOVERRIDE_ID_Msk | USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Msk;

	// Release the PHY power on reset
	NRF_USBHS->ENABLE = USBHS_ENABLE_PHY_Msk | USBHS_ENABLE_CORE_Msk;

	// PHY clock start
	nrfx_coredep_delay_us(45);

	NRF_USBHS->TASKS_START = USBHS_TASKS_START_TASKS_START_Trigger;

	// Settle before anything reads a core register
	nrfx_coredep_delay_us(2);

	// Drop the VBUSVALID override and keep the device role. The native
	// controller connects when it clears SftDiscon.
	NRF_USBHS->PHY.INPUTOVERRIDE = USBHS_PHY_INPUTOVERRIDE_ID_Msk;

	// The wrapper and the core are separate peripheral blocks at separate
	// addresses. Without this the writes above can still be sitting in the
	// write buffer when the core is first read.
	__DSB();

