IOsonata/IOsonata/ARM/Nordic/nRF54/src/usb_ctrlr_nrf54.cpp
	return true;
}

static void UsbdStopCtrlr(void)
{
	NVIC_DisableIRQ(USBHS_IRQn);

	NRF_USBHS->ENABLE = 0;
	__ISB();
	__DSB();
}


static bool nRFUsbVbusDetected(void)
{
	return UsbdVbusPoll();
}

static UsbSpeed_t nRFUsbMaxSpeed(void)
{
	return USB_SPEED_HIGH;
}

static size_t nRFUsbSerial(char *pBuff, size_t BuffLen)
{
	static const char hex[] = "0123456789ABCDEF";
	size_t cnt = 0;

	if (pBuff == nullptr || BuffLen == 0)
	{
		return 0;
	}

	// nrf_ficr_deviceid_get and not FICR->DEVICEID, because the nRF52 keeps
	// the id flat and the nRF54 keeps it under INFO, and the HAL already knows
	// which.
	for (int i = 0; i < 2; i++)
	{
		uint32_t id = nrf_ficr_deviceid_get(NRF_FICR, (uint32_t)i);

		for (int n = 7; n >= 0; n--)
		{
			if (cnt + 1 >= BuffLen)
			{
				pBuff[cnt] = '\0';
				return cnt;
			}

			pBuff[cnt++] = hex[(id >> (n * 4)) & 0x0F];
		}
	}

	pBuff[cnt] = '\0';

	return cnt;
}

static bool nRFUsbPowerInit(const UsbCtrlrCfg_t *pCfg)
{
	if (pCfg == nullptr)
	{
		return false;
	}

	s_UsbdIntPrio = pCfg->IntPrio;
	s_UsbdLowPowerSuspend = pCfg->bLowPowerSuspend;

	// Start the regulator here so VBUS state is available before the native
	// controller is enabled. The wrapper/core power sequence happens later in
	// UsbdStart(), before nRFUsbRegStart() reads the DesignWare registers.
	nrf_vregusb_event_clear(NRF_VREGUSB, NRF_VREGUSB_EVENT_VBUS_DETECTED);
	nrf_vregusb_event_clear(NRF_VREGUSB, NRF_VREGUSB_EVENT_VBUS_REMOVED);
	nrf_vregusb_task_trigger(NRF_VREGUSB, NRF_VREGUSB_TASK_START);

	s_UsbdVbusLevel =
		(*(volatile uint32_t *)((uintptr_t)NRF_VREGUSB +
								NRFX_USBD_VREGUSB_STATUS_OFS) &
		 NRFX_USBD_VREGUSB_STATUS_VBUSDET) != 0;

	s_UsbdInitialized = true;
	s_UsbdStarted = false;
	s_UsbdVbusLast = nRFUsbVbusDetected();

	return true;
}

static bool nRFUsbPowerStart(void)
{
	if (s_UsbdInitialized == false)
	{
		return false;
	}

	if (s_UsbdStarted)
	{
		return true;
	}

	if (nRFUsbVbusDetected() == false)
	{
		// No cable. Not a failure: the poll in UsbdProcess reports the attach
		// and the caller comes back.
		return false;
	}

	if (UsbdXtalRequest() == false)
	{
		return false;
	}

	s_UsbdXtalHeld = true;

	NVIC_SetPriority(USBHS_IRQn, s_UsbdIntPrio);

	if (UsbdStartCtrlr() == false)
	{
		UsbdXtalRelease();
		s_UsbdXtalHeld = false;
		return false;
	}

	s_UsbdStarted = true;
	s_UsbdVbusLast = true;

	return true;
}

static void nRFUsbPowerStop(void)
{
	if (s_UsbdStarted == false)
	{
		return;
	}

	// Stop the controller interrupt before powering down the wrapper.
	NVIC_DisableIRQ(USBHS_IRQn);

	UsbdStopCtrlr();

	if (s_UsbdXtalHeld)
	{
		UsbdXtalRelease();
		s_UsbdXtalHeld = false;
	}

	s_UsbdStarted = false;
}

/**
 * Called from the application main loop through UsbCtrlrProcess. It must cost
 * nothing when there is nothing to do: a pending low power exit to retire, or
 * a VBUS edge. Neither waits.
 */
static void nRFUsbPowerProcess(void)
{
	if (s_UsbdInitialized == false)
	{
		return;
	}


	const bool vbus = nRFUsbVbusDetected();

	if (vbus == s_UsbdVbusLast)
	{
		return;
	}

	// The port reports bus power state through UsbCtrlrVbusDetected(). Turning
	// an edge into USB_EVT_ATTACHED or USB_EVT_DETACHED for the application is
	// the generic layer's job, so there is no cable callback here. The edge is
	// still tracked because the low power path above needs it.
	s_UsbdVbusLast = vbus;
}

//
// Endpoint and DMA registers. Exactly one of these compiles.
//


static inline __attribute__((always_inline))
uint8_t nRF54UsbdDir(uint8_t EpAddr)
{
	return USB_ENDPADDR_IS_IN(EpAddr) ? 1U : 0U;
}

static inline __attribute__((always_inline))
nRF54UsbdXfer_t *nRF54UsbdGetXfer(uint8_t EpAddr)
{
	return &s_Ctrlr.Xfer[USB_ENDPADDR_NUM(EpAddr)][nRF54UsbdDir(EpAddr)];
}

static bool nRF54UsbdWaitSet(volatile uint32_t *pReg, uint32_t Mask)
{
	uint32_t count = NRF54_USBD_WAIT_LOOPS;

	while ((*pReg & Mask) == 0U)
	{
		if (--count == 0U)
		{
			return false;
		}
	}

	return true;
}

static bool nRF54UsbdWaitClear(volatile uint32_t *pReg, uint32_t Mask)
{
	uint32_t count = NRF54_USBD_WAIT_LOOPS;

	while ((*pReg & Mask) != 0U)
	{
		if (--count == 0U)
		{
			return false;
		}
	}

	return true;
}

static bool nRF54UsbdFlushTx(uint8_t FifoNo)
{
	NRF54_USBD_GRSTCTL = NRF54_USBD_GRSTCTL_TXFFLSH |
		((uint32_t)FifoNo << NRF54_USBD_GRSTCTL_TXFNUM_Pos);
	return nRF54UsbdWaitClear(&NRF54_USBD_GRSTCTL,
						  NRF54_USBD_GRSTCTL_TXFFLSH);
}

static bool nRF54UsbdFlushRx(void)
{
	NRF54_USBD_GRSTCTL = NRF54_USBD_GRSTCTL_RXFFLSH;
	return nRF54UsbdWaitClear(&NRF54_USBD_GRSTCTL,
						  NRF54_USBD_GRSTCTL_RXFFLSH);
}

static inline __attribute__((always_inline))
void nRF54UsbdEmit(const UsbCtrlrEvt_t *pEvt)
{
	UsbDevProcessEvent(0, pEvt);
}

static void nRF54UsbdEmitSimple(UsbCtrlrEvtType_t Type)
{
	UsbCtrlrEvt_t evt = { .Type = Type };
	nRF54UsbdEmit(&evt);
}

static void nRF54UsbdEmitXfer(uint8_t EpAddr, uint16_t Length)
{
	if (USB_ENDPADDR_NUM(EpAddr) != 0U)
	{
		nRFUsbEpRegisteredEvent(EpAddr, USB_CTRLR_EVT_XFER_CMPL, Length);
		return;
	}

	UsbCtrlrEvt_t evt = {
		.Type = USB_CTRLR_EVT_XFER_CMPL,
		.Xfer = {
			.EpAddr = EpAddr,
			.Length = Length,
			.Result = USB_CTRLR_XFER_SUCCESS,
			.pBuffer = (const uint8_t *)s_Ep0Bounce,
		},
	};

	nRF54UsbdEmit(&evt);
}

static uint16_t nRF54UsbdRxWords(uint16_t Mps)
{
	uint16_t packetWords = (uint16_t)((Mps + 3U) / 4U);

	// DWC2 device FIFO recommendation for buffer DMA:
	// 13 setup/control words + global NAK + two largest OUT packets +
	// two status words for each OUT endpoint.
	return (uint16_t)(14U + (2U * (packetWords + 1U)) +
					  (2U * NRF54_USBD_EP_COUNT));
}

static bool nRF54UsbdCoreReset(void)
{
	if (!nRF54UsbdWaitSet(&NRF54_USBD_GRSTCTL,
						 NRF54_USBD_GRSTCTL_AHBIDLE))
	{
		return false;
	}

	NRF54_USBD_GRSTCTL |= NRF54_USBD_GRSTCTL_CSFTRST;

	return nRF54UsbdWaitClear(&NRF54_USBD_GRSTCTL,
						   NRF54_USBD_GRSTCTL_CSFTRST);
}

static void nRF54UsbdResetSoftware(void)
{
	memset(&s_Ctrlr, 0, sizeof(s_Ctrlr));
	s_Ctrlr.Xfer[0][0].Mps = NRF54_USBD_EP0_MPS;
	s_Ctrlr.Xfer[0][1].Mps = NRF54_USBD_EP0_MPS;
}

