IOsonata/IOsonata/ARM/Nordic/nRF54/src/usb_ctrlr_nrf54.cpp
	if (USB_ENDPADDR_IS_IN(EpAddr) && zeroLength && s_Ctrlr.AddressPending)
	{
		uint32_t dcfg = NRF54_USBD_DCFG;
		dcfg &= ~NRF54_USBD_DCFG_DEVADDR_Msk;
		dcfg |= (uint32_t)s_Ctrlr.PendingAddress <<
				NRF54_USBD_DCFG_DEVADDR_Pos;
		NRF54_USBD_DCFG = dcfg;
		s_Ctrlr.AddressPending = false;
	}

	if (zeroLength)
	{
		nRF54UsbdPrimeSetup();
	}

	nRF54UsbdEmitXfer(EpAddr, total);
}

static void nRF54UsbdCompleteData(uint8_t EpAddr)
{
	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);

	if (!pXfer->Started)
	{
		return;
	}

	uint16_t remaining;
	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		remaining = (uint16_t)(NRF54_USBD_DIEPTSIZ(epNum) &
							  NRF54_USBD_DEPTSIZ_XFERSIZE_Msk);
	}
	else
	{
		remaining = (uint16_t)(NRF54_USBD_DOEPTSIZ(epNum) &
							  NRF54_USBD_DEPTSIZ_XFERSIZE_Msk);
	}

	const uint16_t actual = remaining <= pXfer->TotalLen ?
		(uint16_t)(pXfer->TotalLen - remaining) : 0U;

	pXfer->ActualLen = actual;
	pXfer->Started = false;
	nRF54UsbdEmitXfer(EpAddr, actual);
	if (!USB_ENDPADDR_IS_IN(EpAddr) &&
		(NRF54_USBD_DAINTMSK & NRF54_USBD_DAINT_OUT(epNum)) != 0U)
	{
		(void)nRFUsbRegEpXfer(epNum, NULL, pXfer->Mps);
	}
}

static void nRF54UsbdBusReset(void)
{
	s_Ctrlr.HighSpeed = false;
	s_Ctrlr.AddressPending = false;
	s_Ctrlr.PendingAddress = 0U;

	uint32_t dcfg = NRF54_USBD_DCFG;
	dcfg &= ~NRF54_USBD_DCFG_DEVADDR_Msk;
	NRF54_USBD_DCFG = dcfg;

	for (uint8_t epNum = 0U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		s_Ctrlr.Xfer[epNum][0].Started = false;
		s_Ctrlr.Xfer[epNum][1].Started = false;
		s_Ctrlr.Xfer[epNum][0].ActualLen = 0U;
		s_Ctrlr.Xfer[epNum][1].ActualLen = 0U;

		NRF54_USBD_DIEPINT(epNum) = 0xFFFFFFFFUL;
		NRF54_USBD_DOEPINT(epNum) = 0xFFFFFFFFUL;

		NRF54_USBD_DOEPCTL(epNum) |= NRF54_USBD_DEPCTL_SNAK;

		if ((NRF54_USBD_DIEPCTL(epNum) & NRF54_USBD_DEPCTL_EPENA) != 0U)
		{
			NRF54_USBD_DIEPCTL(epNum) |=
				NRF54_USBD_DEPCTL_SNAK | NRF54_USBD_DEPCTL_EPDIS;
		}
	}

	(void)nRF54UsbdFlushTx((uint8_t)NRF54_USBD_GRSTCTL_TXFIFO_ALL);
	(void)nRF54UsbdFlushRx();

	nRF54UsbdPrepareEp0();
	nRF54UsbdEmitSimple(USB_CTRLR_EVT_RESET);
}

static void nRF54UsbdSetupEvent(void)
{
	// A new SETUP cancels the previous EP0 transaction.
	s_Ctrlr.Xfer[0][0].Started = false;
	s_Ctrlr.Xfer[0][1].Started = false;
	s_Ctrlr.AddressPending = false;

	uintptr_t setupAddr =
		(uintptr_t)NRF54_USBD_DOEPDMA(0) - NRF54_USBD_SETUP_SIZE;
	const uintptr_t first = (uintptr_t)s_SetupBuffer;
	const uintptr_t last = first + sizeof(s_SetupBuffer) -
						   NRF54_USBD_SETUP_SIZE;

	if (setupAddr < first || setupAddr > last)
	{
		setupAddr = first;
	}

	UsbCtrlrEvt_t evt = { .Type = USB_CTRLR_EVT_SETUP };
	memcpy(&evt.Setup, (const void *)setupAddr, sizeof(evt.Setup));
	nRF54UsbdEmit(&evt);
	if ((evt.Setup.bmRequestType & USB_REQTYPE_MASK_DIR) == 0U &&
		evt.Setup.wLength != 0U)
	{
		nRF54UsbdXfer_t *pXfer = &s_Ctrlr.Xfer[0][0];
		pXfer->TotalLen = evt.Setup.wLength;
		pXfer->ActualLen = 0U;
		pXfer->Started = true;
		(void)nRF54UsbdStartEp0Chunk(USB_ENDPADDR_DIR_OUT);
	}
}

static void nRF54UsbdInInterrupt(void)
{
	const uint32_t pending = NRF54_USBD_DAINT &
							 NRF54_USBD_DAINTMSK & 0xFFFFUL;

	for (uint8_t epNum = 0U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		if ((pending & NRF54_USBD_DAINT_IN(epNum)) == 0U)
		{
			continue;
		}

		const uint32_t epInt = NRF54_USBD_DIEPINT(epNum) &
							   NRF54_USBD_DIEPMSK;
		NRF54_USBD_DIEPINT(epNum) = epInt;

		if ((epInt & NRF54_USBD_DIEPINT_XFRC) != 0U)
		{
			if (epNum == 0U)
			{
				nRF54UsbdCompleteEp0(USB_ENDPADDR_DIR_IN);
			}
			else
			{
				nRF54UsbdCompleteData((uint8_t)(epNum | USB_ENDPADDR_DIR_IN));
			}
		}
	}
}

static void nRF54UsbdOutInterrupt(void)
{
	const uint32_t pending = (NRF54_USBD_DAINT &
							  NRF54_USBD_DAINTMSK) >> 16;

	for (uint8_t epNum = 0U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		if ((pending & (1UL << epNum)) == 0U)
		{
			continue;
		}

		const uint32_t epInt = NRF54_USBD_DOEPINT(epNum) &
							   NRF54_USBD_DOEPMSK;
		NRF54_USBD_DOEPINT(epNum) = epInt;

		if (epNum == 0U && (epInt & NRF54_USBD_DOEPINT_SETUP) != 0U)
		{
			nRF54UsbdSetupEvent();
			continue;
		}

		if ((epInt & NRF54_USBD_DOEPINT_XFRC) != 0U)
		{
			if (epNum == 0U)
			{
				if (s_Ctrlr.Xfer[0][0].Started)
				{
					nRF54UsbdCompleteEp0(USB_ENDPADDR_DIR_OUT);
				}
			}
			else
			{
				nRF54UsbdCompleteData(epNum);
			}
		}
	}
}

static bool nRFUsbRegInit(void)
{
	memset(&s_Ctrlr, 0, sizeof(s_Ctrlr));
	s_Ctrlr.Xfer[0][0].Mps = NRF54_USBD_EP0_MPS;
	s_Ctrlr.Xfer[0][1].Mps = NRF54_USBD_EP0_MPS;
	return true;
}

static bool nRFUsbRegStart(void)
{
	if ((NRF54_USBD_GHWCFG2 & NRF54_USBD_GHWCFG2_ARCH_Msk) !=
		NRF54_USBD_GHWCFG2_ARCH_INTDMA)
	{
		return false;
	}

	NRF54_USBD_DCTL |= NRF54_USBD_DCTL_SFTDISCON;

	if (!nRF54UsbdCoreReset())
	{
		return false;
	}

	nRF54UsbdResetSoftware();

	uint32_t gusbcfg = NRF54_USBD_GUSBCFG;
	gusbcfg &= ~NRF54_USBD_GUSBCFG_FORCEHSTMODE;
	gusbcfg |= NRF54_USBD_GUSBCFG_FORCEDEVMODE;
	NRF54_USBD_GUSBCFG = gusbcfg;

	const uint16_t dfifoDepth =
		(uint16_t)(NRF54_USBD_GHWCFG3 >> NRF54_USBD_GHWCFG3_DFIFO_Pos);
	const uint16_t epInfoWords = 2U * NRF54_USBD_EP_COUNT;
	const uint32_t totalFifo = (uint32_t)dfifoDepth + epInfoWords;

	if (totalFifo > 0xFFFFUL || dfifoDepth <= epInfoWords)
	{
		return false;
	}

	// Buffer DMA reserves one endpoint-info word per endpoint direction. The
	// nRF54 GHWCFG3 depth is the 3040-word data FIFO; GDFIFOCFG then places the
	// endpoint-info controller immediately above it in the 3072-word RAM.
	s_Ctrlr.FifoTop = dfifoDepth;
	NRF54_USBD_GDFIFOCFG =
		((uint32_t)dfifoDepth << 16) | dfifoDepth;

	s_Ctrlr.RxWords = nRF54UsbdRxWords(NRF54_USBD_EP0_MPS);
	NRF54_USBD_GRXFSIZ = s_Ctrlr.RxWords;

	if (!nRF54UsbdAllocateTxFifo(0U, NRF54_USBD_EP0_MPS))
	{
		return false;
	}

	uint32_t gahbcfg = NRF54_USBD_GAHBCFG;
	gahbcfg &= ~(0xFUL << 1);
	gahbcfg |= NRF54_USBD_GAHBCFG_HBSTLEN_INCR4 |
			   NRF54_USBD_GAHBCFG_DMAEN;
	gahbcfg &= ~NRF54_USBD_GAHBCFG_GINT;
	NRF54_USBD_GAHBCFG = gahbcfg;

	uint32_t dcfg = NRF54_USBD_DCFG;
	dcfg &= ~(NRF54_USBD_DCFG_DEVSPD_Msk |
			  NRF54_USBD_DCFG_DEVADDR_Msk);
	dcfg |= NRF54_USBD_DCFG_DEVSPD_HS;
	NRF54_USBD_DCFG = dcfg;

