IOsonata/IOsonata/ARM/Nordic/nRF54/src/usb_ctrlr_nrf54.cpp
	NRF54_USBD_GINTMSK = 0U;
	NRF54_USBD_GINTSTS = 0xFFFFFFFFUL;
	NRF54_USBD_DAINTMSK = 0U;
	NRF54_USBD_DIEPMSK = 0U;
	NRF54_USBD_DOEPMSK = 0U;

	for (uint8_t epNum = 0U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		NRF54_USBD_DIEPINT(epNum) = 0xFFFFFFFFUL;
		NRF54_USBD_DOEPINT(epNum) = 0xFFFFFFFFUL;
	}

	nRF54UsbdPrepareEp0();

	NRF54_USBD_GINTMSK =
		NRF54_USBD_GINTSTS_USBRST |
		NRF54_USBD_GINTSTS_ENUMDONE |
		NRF54_USBD_GINTSTS_IEPINT |
		NRF54_USBD_GINTSTS_OEPINT |
		NRF54_USBD_GINTSTS_USBSUSP |
		NRF54_USBD_GINTSTS_WKUPINT;

	s_Ctrlr.Started = true;
	return true;
}

static void nRFUsbRegStop(void)
{
	if (!s_Ctrlr.Started)
	{
		return;
	}

	NRF54_USBD_GAHBCFG &= ~NRF54_USBD_GAHBCFG_GINT;
	NRF54_USBD_GINTMSK = 0U;
	NRF54_USBD_DCTL |= NRF54_USBD_DCTL_SFTDISCON;

	for (uint8_t epNum = 0U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		s_Ctrlr.Xfer[epNum][0].Started = false;
		s_Ctrlr.Xfer[epNum][1].Started = false;
	}

	s_Ctrlr.Started = false;
	s_Ctrlr.HighSpeed = false;
	s_Ctrlr.AddressPending = false;
}

static bool nRFUsbRegHighSpeed(void)
{
	return s_Ctrlr.Started && s_Ctrlr.HighSpeed;
}

static void nRFUsbRegIntEnable(void)
{
	NRF54_USBD_GAHBCFG |= NRF54_USBD_GAHBCFG_GINT;
	NVIC_ClearPendingIRQ(USBHS_IRQn);
	NVIC_EnableIRQ(USBHS_IRQn);
}

static void nRFUsbRegIntDisable(void)
{
	NVIC_DisableIRQ(USBHS_IRQn);
	NRF54_USBD_GAHBCFG &= ~NRF54_USBD_GAHBCFG_GINT;
}

static void nRFUsbRegConnect(void)
{
	NRF54_USBD_DCTL &= ~NRF54_USBD_DCTL_SFTDISCON;
}

static void nRFUsbRegDisconnect(void)
{
	NRF54_USBD_DCTL |= NRF54_USBD_DCTL_SFTDISCON;
}

static void nRFUsbRegRemoteWakeup(void)
{
	NRF54_USBD_DCTL |= NRF54_USBD_DCTL_RMTWKUPSIG;
	nrfx_coredep_delay_us(2000U);
	NRF54_USBD_DCTL &= ~NRF54_USBD_DCTL_RMTWKUPSIG;
}

static void nRFUsbRegSofEnable(bool Enable)
{
	s_Ctrlr.SofEnabled = Enable;

	if (Enable)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_SOF;
		NRF54_USBD_GINTMSK |= NRF54_USBD_GINTSTS_SOF;
	}
	else
	{
		NRF54_USBD_GINTMSK &= ~NRF54_USBD_GINTSTS_SOF;
	}
}

static void nRFUsbRegSetAddress(uint8_t Address)
{
	s_Ctrlr.PendingAddress = (uint8_t)(Address & 0x7FU);
	s_Ctrlr.AddressPending = true;
}

static bool nRFUsbRegEpOpen(uint8_t epAddr, uint8_t type, uint16_t mps)
{
	if (!s_Ctrlr.Started)
	{
		return false;
	}

	const uint8_t epNum = USB_ENDPADDR_NUM(epAddr);

	if (epNum == 0U || epNum >= NRF54_USBD_EP_COUNT ||
		(type != USB_ENDPATT_TRANS_BULK &&
		 type != USB_ENDPATT_TRANS_INT) ||
		mps == 0U)
	{
		return false;
	}

	const uint16_t maxMps = type == USB_ENDPATT_TRANS_BULK ?
		(s_Ctrlr.HighSpeed ? 512U : 64U) :
		(s_Ctrlr.HighSpeed ? 1024U : 64U);
	if (mps > maxMps)
	{
		return false;
	}

	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(epAddr);
	pXfer->Mps = mps;
	pXfer->Started = false;
	pXfer->ActualLen = 0U;

	const uint32_t epType =
		nRF54UsbdEpType(type) << NRF54_USBD_DEPCTL_EPTYPE_Pos;

	if (USB_ENDPADDR_IS_IN(epAddr))
	{
		if (!nRF54UsbdAllocateTxFifo(epNum, mps))
		{
			return false;
		}

		uint32_t ctl = NRF54_USBD_DIEPCTL(epNum);
		ctl &= ~(NRF54_USBD_DEPCTL_MPS_Msk |
				 NRF54_USBD_DEPCTL_EPTYPE_Msk |
				 NRF54_USBD_DIEPCTL_TXFNUM_Msk |
				 NRF54_USBD_DEPCTL_STALL);
		ctl |= mps |
			   epType |
			   NRF54_USBD_DEPCTL_USBACTEP |
			   NRF54_USBD_DEPCTL_SETD0PID |
			   ((uint32_t)epNum << NRF54_USBD_DIEPCTL_TXFNUM_Pos);
		NRF54_USBD_DIEPCTL(epNum) = ctl;
		NRF54_USBD_DAINTMSK |= NRF54_USBD_DAINT_IN(epNum);
	}
	else
	{
		if (!nRF54UsbdGrowRxFifo(mps))
		{
			return false;
		}

		uint32_t ctl = NRF54_USBD_DOEPCTL(epNum);
		ctl &= ~(NRF54_USBD_DEPCTL_MPS_Msk |
				 NRF54_USBD_DEPCTL_EPTYPE_Msk |
				 NRF54_USBD_DEPCTL_STALL);
		ctl |= mps |
			   epType |
			   NRF54_USBD_DEPCTL_USBACTEP |
			   NRF54_USBD_DEPCTL_SETD0PID;
		NRF54_USBD_DOEPCTL(epNum) = ctl;
		NRF54_USBD_DAINTMSK |= NRF54_USBD_DAINT_OUT(epNum);
		(void)nRFUsbRegEpXfer(epNum, NULL, mps);
	}

	return true;
}

static void nRFUsbRegEpClose(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum == 0U || epNum >= NRF54_USBD_EP_COUNT)
	{
		return;
	}

	(void)nRF54UsbdDisableEndpoint(EpAddr, false);

	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	pXfer->Started = false;
	pXfer->ActualLen = 0U;
	pXfer->TotalLen = 0U;
	pXfer->ChunkLen = 0U;
	pXfer->pBuffer = NULL;

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		NRF54_USBD_DAINTMSK &= ~NRF54_USBD_DAINT_IN(epNum);
	}
	else
	{
		NRF54_USBD_DAINTMSK &= ~NRF54_USBD_DAINT_OUT(epNum);
	}
}

static void nRFUsbRegEpCloseAll(void)
{
	for (uint8_t epNum = 1U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		nRFUsbRegEpClose(epNum);
		nRFUsbRegEpClose((uint8_t)(epNum | USB_ENDPADDR_DIR_IN));
	}

	(void)nRF54UsbdFlushRx();
}

static bool nRFUsbRegEpXfer(uint8_t EpAddr, uint8_t *pBuffer, uint16_t TotalBytes)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	uint8_t *pDmaBuffer = epNum == 0U ? pBuffer :
		nRFUsbGetEpReg(EpAddr)->pBuffer;
	if (epNum != 0U && !USB_ENDPADDR_IS_IN(EpAddr) && pDmaBuffer == NULL)
	{
		return false;
	}
	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);

	pXfer->pBuffer = epNum == 0U ? pBuffer : NULL;
	pXfer->TotalLen = TotalBytes;
	pXfer->ActualLen = 0U;
	pXfer->ChunkLen = 0U;
	pXfer->Started = true;

	if (epNum == 0U)
	{
		return nRF54UsbdStartEp0Chunk(EpAddr);
	}

	const uint32_t packetCnt = TotalBytes == 0U ? 1U :
		((uint32_t)TotalBytes + pXfer->Mps - 1U) / pXfer->Mps;

	if (packetCnt > 0x3FFUL)
	{
		pXfer->Started = false;
		return false;
	}

	const uint32_t size =
		((uint32_t)TotalBytes & NRF54_USBD_DEPTSIZ_XFERSIZE_Msk) |
		(packetCnt << NRF54_USBD_DEPTSIZ_PKTCNT_Pos);

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		NRF54_USBD_DIEPDMA(epNum) = (uint32_t)(uintptr_t)pDmaBuffer;
		NRF54_USBD_DIEPTSIZ(epNum) = size;
		NRF54_USBD_DIEPCTL(epNum) |=
			NRF54_USBD_DEPCTL_CNAK | NRF54_USBD_DEPCTL_EPENA;
	}
	else
	{
		NRF54_USBD_DOEPDMA(epNum) = (uint32_t)(uintptr_t)pDmaBuffer;
		NRF54_USBD_DOEPTSIZ(epNum) = size;
		NRF54_USBD_DOEPCTL(epNum) |=
			NRF54_USBD_DEPCTL_CNAK | NRF54_USBD_DEPCTL_EPENA;
	}

	return true;
}

static uint16_t nRFUsbRegEpMps(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	return epNum < NRF54_USBD_EP_COUNT ? nRF54UsbdGetXfer(EpAddr)->Mps : 0U;
}

static void nRFUsbRegEpStall(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum >= NRF54_USBD_EP_COUNT)
	{
		return;
	}

	(void)nRF54UsbdDisableEndpoint(EpAddr, true);

	// EP0 OUT remains active for SETUP reception. If the setup queue was
	// exhausted by the failed request, re-arm it without clearing STALL.
	if (epNum == 0U && !USB_ENDPADDR_IS_IN(EpAddr))
	{
		nRF54UsbdPrimeSetup();
	}
}

static void nRFUsbRegEpClearStall(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum >= NRF54_USBD_EP_COUNT)
	{
		return;
	}

