IOsonata/IOsonata/ARM/Nordic/nRF54/src/usb_ctrlr_nrf54.cpp
	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		uint32_t ctl = NRF54_USBD_DIEPCTL(epNum);
		ctl &= ~NRF54_USBD_DEPCTL_STALL;
		if (epNum != 0U)
		{
			ctl |= NRF54_USBD_DEPCTL_SETD0PID;
		}
		NRF54_USBD_DIEPCTL(epNum) = ctl;
	}
	else
	{
		uint32_t ctl = NRF54_USBD_DOEPCTL(epNum);
		ctl &= ~NRF54_USBD_DEPCTL_STALL;
		if (epNum != 0U)
		{
			ctl |= NRF54_USBD_DEPCTL_SETD0PID;
		}
		NRF54_USBD_DOEPCTL(epNum) = ctl;
	}
}

void USBHS_IRQHandler(void)
{
	const uint32_t status = NRF54_USBD_GINTSTS & NRF54_USBD_GINTMSK;
	if (status == 0U)
	{
		return;
	}

	if ((status & NRF54_USBD_GINTSTS_USBRST) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_USBRST;
		nRF54UsbdBusReset();
	}

	if ((status & NRF54_USBD_GINTSTS_ENUMDONE) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_ENUMDONE;
		s_Ctrlr.HighSpeed =
			(NRF54_USBD_DSTS & NRF54_USBD_DSTS_ENUMSPD_Msk) ==
			NRF54_USBD_DSTS_ENUMSPD_HS;
	}

	if ((status & NRF54_USBD_GINTSTS_OEPINT) != 0U)
	{
		nRF54UsbdOutInterrupt();
	}

	if ((status & NRF54_USBD_GINTSTS_IEPINT) != 0U)
	{
		nRF54UsbdInInterrupt();
	}

	if ((status & NRF54_USBD_GINTSTS_USBSUSP) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_USBSUSP;
		nRF54UsbdEmitSimple(USB_CTRLR_EVT_SUSPEND);
	}

	if ((status & NRF54_USBD_GINTSTS_WKUPINT) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_WKUPINT;
		nRF54UsbdEmitSimple(USB_CTRLR_EVT_RESUME);
	}

	if ((status & NRF54_USBD_GINTSTS_SOF) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_SOF;

		if (s_Ctrlr.SofEnabled)
		{
			UsbCtrlrEvt_t evt = {
				.Type = USB_CTRLR_EVT_SOF,
				.FrameNo = (uint16_t)((NRF54_USBD_DSTS &
									  NRF54_USBD_DSTS_FNSOF_Msk) >>
									  NRF54_USBD_DSTS_FNSOF_Pos),
			};
			nRF54UsbdEmit(&evt);
		}
	}
}


//
// Entry points declared in usb.h. Each validates DevNo and then runs the
// power stage and the register stage in the order the hardware needs.
//

bool UsbCtrlrInit(int DevNo, const UsbCtrlrCfg_t *pCfg)
{
	if (!nRFUsbValidDevNo(DevNo) || pCfg == NULL)
	{
		return false;
	}

	memset(s_EpReg, 0, sizeof(s_EpReg));

	// Power first. The register stage must not touch a peripheral that has no
	// clock, which is why nRFUsbRegInit only sets software state.
	if (!nRFUsbPowerInit(pCfg))
	{
		return false;
	}

	return nRFUsbRegInit();
}

bool UsbCtrlrStart(int DevNo)
{
	if (!nRFUsbValidDevNo(DevNo))
	{
		return false;
	}

	// One call where usbd.h and usbd_ctrlr.h used to need two. Power, clock
	// and PHY come up, then endpoint zero is prepared.
	if (!nRFUsbPowerStart())
	{
		return false;
	}

	if (!nRFUsbRegStart())
	{
		nRFUsbPowerStop();
		return false;
	}

	return true;
}

void UsbCtrlrStop(int DevNo)
{
	if (!nRFUsbValidDevNo(DevNo))
	{
		return;
	}

	nRFUsbRegStop();
	nRFUsbPowerStop();
}

void UsbCtrlrProcess(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbPowerProcess();
		AppEvtHandlerExec();
		if (!s_Ctrlr.Started)
		{
			return;
		}
		const uint32_t state = DisableInterrupt();
		for (uint8_t epNum = 1U; epNum < NRF_USB_EP_COUNT; epNum++)
		{
			if ((NRF54_USBD_DAINTMSK & NRF54_USBD_DAINT_OUT(epNum)) == 0U ||
				s_Ctrlr.Xfer[epNum][0].Started)
			{
				continue;
			}
			nRFUsbEpReg_t *pReg = &s_EpReg[epNum][0];
			if (pReg->pBuffer == NULL && pReg->Handler != NULL)
			{
				nRFUsbEpRegisteredEvent(epNum, USB_CTRLR_EVT_DRDY, 0U);
			}
			(void)nRFUsbRegEpXfer(epNum, NULL, s_Ctrlr.Xfer[epNum][0].Mps);
		}
		EnableInterrupt(state);
	}
}

bool UsbCtrlrVbusDetected(int DevNo)
{
	return nRFUsbValidDevNo(DevNo) && nRFUsbVbusDetected();
}

bool UsbCtrlrHighSpeed(int DevNo)
{
	return nRFUsbValidDevNo(DevNo) && nRFUsbRegHighSpeed();
}

size_t UsbCtrlrGetSerial(int DevNo, char *pBuff, size_t BuffLen)
{
	return nRFUsbValidDevNo(DevNo) ? nRFUsbSerial(pBuff, BuffLen) : 0;
}

void UsbCtrlrIntEnable(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegIntEnable();
	}
}

void UsbCtrlrIntDisable(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegIntDisable();
	}
}

void UsbCtrlrConnect(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegConnect();
	}
}

void UsbCtrlrDisconnect(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegDisconnect();
	}
}

void UsbCtrlrRemoteWakeup(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegRemoteWakeup();
	}
}

void UsbCtrlrSofEnable(int DevNo, bool Enable)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegSofEnable(Enable);
	}
}

void UsbCtrlrSetAddress(int DevNo, uint8_t Address)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegSetAddress(Address);
	}
}

bool UsbCtrlrEpOpen(int DevNo, const UsbEndPointDesc_t *pDesc)
{
	return nRFUsbValidDevNo(DevNo) && pDesc != NULL &&
		nRFUsbRegEpOpen(pDesc->bEndpointAddress,
			pDesc->bmAttributes & 0x03U, pDesc->wMaxPacketSize);
}

bool UsbCtrlrEpOpenData(int DevNo, uint8_t EpNo, bool bIn, uint8_t Type,
						 uint16_t MaxPacketSize)
{
	const uint8_t epAddr = (uint8_t)(EpNo |
		(bIn ? USB_ENDPADDR_DIR_IN : 0U));
	return nRFUsbValidDevNo(DevNo) &&
		nRFUsbRegEpOpen(epAddr, Type, MaxPacketSize);
}

void UsbCtrlrEpClose(int DevNo, uint8_t EpNo, bool bIn)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegEpClose((uint8_t)(EpNo |
			(bIn ? USB_ENDPADDR_DIR_IN : 0U)));
	}
}

void UsbCtrlrEpCloseAll(int DevNo)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegEpCloseAll();
	}
}

void UsbCtrlrEpAlloc(int DevNo, uint8_t EpNo, bool bIn, uint8_t *pBuffer,
					 bool bBlocking,
					 UsbCtrlrEpHandler_t Handler, void *pContext)
{
	if (!nRFUsbValidDevNo(DevNo))
	{
		return;
	}
	const uint8_t epAddr = (uint8_t)(EpNo |
		(bIn ? USB_ENDPADDR_DIR_IN : 0U));
	nRFUsbEpReg_t *pReg = nRFUsbGetEpReg(epAddr);
	pReg->pBuffer = pBuffer;
	pReg->Handler = Handler;
	pReg->pContext = pContext;
	pReg->bBlocking = bBlocking;
}

bool UsbCtrlrEpSend(int DevNo, uint8_t EpNum, uint8_t *pBuffer,
						 uint16_t Length)
{
	(void)DevNo;
	nRFUsbGetEpReg(USB_ENDPADDR_DIRIN(EpNum))->pBuffer = pBuffer;
	return nRFUsbRegEpXfer(USB_ENDPADDR_DIRIN(EpNum), NULL, Length);
}

bool UsbCtrlrEpOutXfer(int, uint8_t, uint16_t)
{
	return false;
}

bool UsbCtrlrEpInXfer(int, uint8_t, uint16_t)
{
	return false;
}


bool UsbCtrlrEp0Status(int DevNo, uint8_t EpAddr)
{
	return nRFUsbValidDevNo(DevNo) && nRFUsbRegEpXfer(EpAddr, NULL, 0U);
}

int UsbCtrlrEp0Send(int DevNo, uint8_t *pBuffer, int Length)
{
	if (!nRFUsbValidDevNo(DevNo) || Length < 0 || Length > UINT16_MAX)
		return -1;

	// The upper layer submits the remainder on completion. Copy this packet
	// into the existing bounce buffer before returning to its source owner.
	const uint16_t copied = Length < (int)NRF54_USBD_EP0_MPS ?
		(uint16_t)Length : NRF54_USBD_EP0_MPS;
	return nRFUsbRegEpXfer(USB_ENDPADDR_DIR_IN, pBuffer, copied) ? copied : -1;
}

void UsbCtrlrEpStall(int DevNo, uint8_t EpNo, bool bIn)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegEpStall((uint8_t)(EpNo |
			(bIn ? USB_ENDPADDR_DIR_IN : 0U)));
	}
}

void UsbCtrlrEpClearStall(int DevNo, uint8_t EpNo, bool bIn)
{
	if (nRFUsbValidDevNo(DevNo))
	{
		nRFUsbRegEpClearStall((uint8_t)(EpNo |
			(bIn ? USB_ENDPADDR_DIR_IN : 0U)));
	}
}
